frontend/controllers/SiteController.php

    public function actionIndex()
    {

        $results = yii::$app->cache->get(md5('frontend_preloader'));

        if (yii::$app->params['enable_cache'] && !$results) {

            $periods = yii::$app->params['time_periods'];
            $rooms_count = [];

            $cities = City::find()->asArray()->all();

            foreach($cities as $city) {
                $rooms_count[$city['id']] = [
                    'room_count' => 0,
                    'city_id' => $city['id'],
                ];
            }

            $city_ids = array_column($cities, 'id');

            $rooms_count_array = BathhouseRoom::find()
                ->select('count(*) as room_count, bathhouse_room.city_id')
                ->joinWith('bathhouse', false)
                ->where(['bathhouse.is_active' => 1, 'bathhouse_room.city_id' => $city_ids])
                ->groupBy('bathhouse_room.city_id')
                ->indexBy('city_id')
                ->asArray()
                ->all();
---
SELECT * FROM `city`
SELECT count(*) as room_count, `bathhouse_room`.`city_id` FROM `bathhouse_room` LEFT JOIN `bathhouse` ON `bathhouse_room`.`bathhouse_id` = `bathhouse`.`id` WHERE (`bathhouse`.`is_active`=1) AND (`bathhouse_room`.`city_id` IN ('1', '2', '3')) GROUP BY `bathhouse_room`.`city_id`

                $rooms_count[$rooms_count_item['city_id']] = $rooms_count_item;
            }

            $filters = BathhouseRoomPrice::find()
                ->select(
                    'MIN(bathhouse_room_price.price) as minPrice,
                     MAX(bathhouse_room_price.price)as maxPrice,
                     MIN(bathhouse.distance) as minDistance,
                     MAX(bathhouse.distance) as maxDistance,
                     MAX(bathhouse_room_setting.guest_threshold) as maxFreeGuests,
                     MAX(bathhouse_room_setting.guest_limit) as maxExtraGuests,
                     bathhouse_room.city_id'
                )
                ->joinWith(['bathhouseRoom', 'bathhouseRoom.bathhouse', 'bathhouseRoom.settings'], false)
                ->where([
                    'bathhouse.is_active'    => 1,
                    'bathhouse_room.city_id' => $city_ids])
                ->groupBy(['bathhouse_room.city_id'])
                ->indexBy('city_id')
                ->asArray()
                ->all();
---
SELECT MIN(bathhouse_room_price.price) as minPrice, MAX(bathhouse_room_price.price)as maxPrice, MIN(bathhouse.distance) as minDistance, MAX(bathhouse.distance) as maxDistance, MAX(bathhouse_room_setting.guest_threshold) as maxFreeGuests, MAX(bathhouse_room_setting.guest_limit) as maxExtraGuests, `bathhouse_room`.`city_id` FROM `bathhouse_room_price` LEFT JOIN `bathhouse_room` ON `bathhouse_room_price`.`room_id` = `bathhouse_room`.`id` LEFT JOIN `bathhouse` ON `bathhouse_room`.`bathhouse_id` = `bathhouse`.`id` LEFT JOIN `bathhouse_room_setting` ON `bathhouse_room`.`id` = `bathhouse_room_setting`.`room_id` WHERE (`bathhouse`.`is_active`=1) AND (`bathhouse_room`.`city_id` IN ('1', '2', '3')) GROUP BY `bathhouse_room`.`city_id`